class Cars extends React.Component {
    cars = [
        {
        id: 1,
        carName: "НАМИ-1",
        discript: `Перший легковий автомобіль, створений СРСР. 
                   Був розроблений 1927 року Науковим автомоторним інститутом (НАМІ) 
                   на базі дипломного проекту молодого інженера Костянтина Андрійовича Шарапова. 
                   Проект НАМІ-1 був спробою поєднати простоту конструкції, дешевизну та інші позитивні якості мотоцикла з коляскою або 
                   сайклкара з пасажиромісткістю та комфортабельністю чотиримісного малолітражного легкового автомобіля.`
        },
        {
        id: 2,
        carName: "Alfa Romeo 6C",
        discript: `Серія 6-циліндрових легкових, гоночних та спортивних автомобілів, які випускає компанія Alfa Romeo з 1925 по 1954 рік. 
                   Автомобіль був зібраний на базі гоночного Alfa Romeo P2 з 6-циліндровим двигуном об'ємом 1,5 літра та потужністю 44 л. с.`
        },
        {
        id: 3,
        carName: "Alfa Romeo RL",
        discript: `Спортивний автомобіль італійської автомобільної компанії Alfa Romeo, що вироблявся в період з 1922 по 1927 роки. 
                   Це була перша спортивна модель компанії після Першої світової війни. Автомобіль був розроблений у 1921 році італійським інженером 
                   Джузеппе Мерозі. Модель мала шестициліндровий рядний (L6) двигун із клапанами зверху. 
                   Усього було випущено три різні модифікації: Normale, Turismo та Sport.`
        },
        {
        id: 4,
        carName: "Austin 7",
        discript: `Бюджетний автомобіль компанії Austin Motor Company, що вироблявся з 1922 по 1939 рік у Великій Британії. 
                   Мав прізвисько «Малютка Остін». Один з найпопулярніших автомобілів, які колись продавалися на британському ринку. 
                   Він витіснив більшість недорогих автомобілів виробництва 1920-х років і зробив на Англію той самий ефект, як і Форд Т США. 
                   Автомобіль вироблявся різними компаніями по всьому світу.`
        },
        {
        id: 5,
        carName: "Bentley 3 Litre",
        discript: `Спорткар від Bentley Motors представлений у 1919 році. Це був великий та важкий (1800 кг) автомобіль. 
                   Проте 1924 року гонщики Джон Дафф і Клемент Франк виграли гонку «24 години Ле-Мана». А в 1927 році пілоти S. C. H. Sammy Davis and Dudley Benjafield 
                   виграли гонку на цьому автомобілі в клас Супер Спорт. За розмір і швидкість Bentley 3 Litre Етторе Бугатті прозвав його «найшвидшою вантажівкою у світі».`
        },
        {
        id: 6,
        carName: "Citroën C6",
        discript: `Легковий автомобіль, вперше представлений на Паризькому автосалоні в жовтні 1928 року, 
                   а потім серійно випускався фірмою Citroën у 1929—32 роках. 
                   Перший шестициліндровий автомобіль цієї компанії. Усього було випущено 61 280 екземплярів.`
        },
        {
        id: 7,
        carName: "Duesenberg Model J",
        discript: `Американський автомобіль класу люкс марки Duesenberg, що вироблявся протягом 1928-1937 років. 
                   На початок Великої депресії було побудовано 200 авто (жовтень 1929), наступного року ще 100, при намірі продавати щорічно 500 шасі. 
                   Це був один із найшвидших і найдорожчих автомобілів світу.`
        },
        {
        id: 8,
        carName: "Ford Model A",
        discript: `Автомобіль, що вироблявся компанією Ford Motor Company з 1927 по 1931 рік. Друга модель з індексом A у виробництві компанії. 
                   На моделі встановлювався 4-циліндровий двигун рідинного охолодження робочим об'ємом 3,28 л, що розвиває 40 кінських сил. 
                   Model A 1927 модельного року була першою моделлю Ford, яка використовувала стандартний набір органів управління 
                   зі звичайними педалями зчеплення та гальма та акселератора та важелем КПП на відміну від попередніх моделей Ford.`
        },
        {
        id: 9,
        carName: "Ford Model T",
        discript: `Також відомий, як "Бляшана Ліззі" - автомобіль, що випускався Ford Motor Company з 1908 по 1927 роки. 
                   Був першим у світі автомобілем, що випускався мільйонними серіями. Генрі Форд, на думку багатьох, «посадив Америку на колеса», 
                   зробивши новий легковий автомобіль порівняно доступним для американця середнього класу.`
        },
        {
        id: 10,
        carName: "Rolls-Royce 40/50HP Silver Ghost",
        discript: `Автомобіль преміум-класу, розроблений та випусканий британською компанією Rolls-Royce. 
                   Rolls-Royce 40/50HP, що розроблявся в 1905—1906 роках і вперше представлений публіці в березні 1907-го, випускався аж до 1926 року. 
                   Загальний випуск становив 7874 одиниць.`
        }
    ];

    render() {
        return (<div>
                {this.cars.map((el) => (
                    <div key={el.id}>
                        <h3>{el.carName}</h3>
                        <p>{el.discript}</p>
                    </div>
                ))}
            </div>
        );
    }
}


class CarList extends React.Component {
    render() {
        return (
            <main className="nav-left">
                <Cars />
            </main>
        );
    }
}


ReactDOM.render(<CarList />, document.getElementById("root"))