class Cars extends React.Component {
    cars = [
        {
        id: 1,
        carName: "Cadillac Series 60",
        discript: `Середньорозмірний за розмірами та ціновою категорією автомобіль «престижного» підрозділу General Motors — Cadillac, 
                   що випускався з 1936 по 1938 рік. З 1939 року випускалася модель Sixty Special, похідна від Series 60, 
                   і ця назва зберігалася в модельному ряду Cadillac до 1993 року.`
        },
        {
        id: 2,
        carName: "Chrysler New Yorker",
        discript: `Американський повнорозмірний легковий автомобіль, що випускався Chrysler Corporation як модель з 1939 по 1996 рік. 
                   Більшу частину своєї історії ця модель займала в модельному ряді корпорації проміжне положення між дешевшими масовими моделями 
                   та ексклюзивними Chrysler Imperial та Imperial, приблизно відповідаючи автомобілям таких конкурентних брендів, як Buick, Oldsmobile та Mercury.`
        },
        {
        id: 3,
        carName: "Citroën TUB",
        discript: `Передвоєнний автофургон, що випускався серійно-французькою компанією Citroën у 1939—1941 роках. 
                   Перший у світі комерційний передньопривідний автомобіль із бічними розсувними дверима. Усього було вироблено 1748 машин.`
        },
        {
        id: 4,
        carName: "Cord 810",
        discript: `Американські автомобілі класу люкс, що виготовлялися компанією Cord Automobile у 1936-1937 роках. 
                   Модель 810 була покликана врятувати від банкрутства автомобільну компанію та з'явилася через три роки після згортання виробництва Cord L-29. 
                   Вперше її побачили відвідувачі Нью-Йоркського автошоу 2 листопада 1935 року. Готували модель неповних чотири місяці, 
                   для участі у шоу потрібно було створити сто екземплярів, тому виставкові зразки навіть не мали трансмісії — 
                   розробники просто не встигли зібрати їх остаточно.`
        },
        {
        id: 5,
        carName: "Delahaye 135",
        discript: `Французький автомобіль класу люкс марки Delahaye, що вироблявся у 1935-1954 роках. Існувала також гоночна версія. 
                   Передові на ті часи технічні рішення дозволяли 120-сильному агрегату розганятися до 161 км/год. 
                   Модифікація Des Alpes мала незалежну поперечну ресорну підвіску, центральний замок та чотириступінчасту коробку із синхронізаторами.`
        },
        {
        id: 6,
        carName: "Duesenberg Model J",
        discript: `Американський автомобіль класу люкс марки Duesenberg, що вироблявся протягом 1928-1937 років. 
                   а початок Великої депресії було побудовано 200 авто (жовтень 1929), наступного року ще 100, при намірі продавати щорічно 500 шасі. 
                   Це був один із найшвидших і найдорожчих автомобілів світу.`
        },
        {
        id: 7,
        carName: "Ford Model B",
        discript: `Автомобіль Ford, виробництво якого почалося 1932 року і тривало до 1934 року. 
                   Це оновлена ​​версія Ford A і була замінена 1935 року Ford Model 48. На автомобіль встановлювали 4-циліндровий двигун (покращена версія двигуна Ford Model A), 
                   але Ford також виробляв дуже схожу модель з 8-циліндровим двигуном.`
        },
        {
        id: 8,
        carName: "Horch 853 Voll & Ruhrbeck Sport Cabriolet",
        discript: `Історія автомобіля залишається загадкою. Під час війни союзницькими бомбардувальниками було знищено завод Voll & Ruhrbeck, 
                   а разом із ним і документацію. Проте автомобіль пережив хаос, був захоплений французьким урядом і потрапив до рук маршала 
                   французької армії Жан Марі де Латр де Тассіньї. У повоєнний час був переміщений до Швейцарії, 
                   після чого був кілька разів перекуплений та реставрований.`
        },
        {
        id: 9,
        carName: "Phantom Corsair",
        discript: `Прототип автомобіля, збудований у 1938 році. Це шестимісне купе, яке було розроблене Растом Хайнцем із родини Хайнц 
                   та Морісом Шварцем із кузовобудівної компанії Bohman & Schwartz у місті Пасадіна, штат Каліфорнія. 
                   Хоча іноді проект вважають провальним, тому що він так і не був запущений у виробництво, Corsair випередив свій час завдяки 
                   футуристичному дизайну, конструкції та особливостям, таким як закриті крила та низький профіль кузова.`
        },
        {
        id: 10,
        carName: "Volvo LV81",
        discript: `Серія середньотоннажних вантажних автомобілів, що випускалися шведським автовиробником Volvo Trucks у 1935-1940 роках. 
                   В 1936 замість двигунів внутрішнього згоряння EC, DC і HA автомобіль оснащувався двигуном Хессельмана FC.`
        }
    ];

    render() {
        return (<div>
                {this.cars.map((el) => (
                    <div key={el.id}>
                        <h3>{el.carName}</h3>
                        <p>{el.discript}</p>
                    </div>
                ))}
            </div>
        );
    }
}


class CarList extends React.Component {
    render() {
        return (
            <main className="nav-left">
                <Cars />
            </main>
        );
    }
}


ReactDOM.render(<CarList />, document.getElementById("root"))